Embracecactus/contest2026_135_yongwangzhiqian/board/bk7258/bootloader/boot_main.c
/*
 * boot_main.c - BK7258 Tier-1 bootloader C main.
 *
 *   uint32_t c_main(void);
 *
 * Responsibilities (Tier-1 features I / A, with J handled by start.S):
 *   I  Configurable UART logging of boot progress.
 *   A  FAL partition table parse -> locate "app", derive its logical address.
 *      App header validation (MSP / Reset Thumb / "BK7236\0\0" magic).
 * On success c_main prints "jump to:0x02010000\r\n", "JMP\r\n" and returns
 * the app logical vector address (e.g. 0x02010000). On failure it prints
 * "BAD\r\n" plus a short reason, then takes the bounded watchdog-reset
 * failure path (never returns).
 *
 * The app logical address equals FLASH_BASE + partition.offset, so the same
 * scan works if the table is later moved to a real flash partition.
 *
 * Freestanding: no libc, no mutable globals -> no .bss zeroing needed by
 * c_main (start.S calls c_main directly without a C runtime startup).
 */

#include <stdint.h>
#include <stddef.h>

#include "boot_bl1_manifest.h"
#include "boot_bl1_handoff_core.h"
#include "boot_bl1_policy.h"
#include "boot_bl2_contract.h"
#include "boot_flash.h"
#include "boot_wdt.h"
#include "../chip/include/bk7258_memorymap.h"
#include "../include/bk7258_partition_layout.h"

extern void boot_clock_cold_init(void);

/* ------------------------------------------------------------------ */
/* MMIO: selected BK7258 boot UART (matches the init in start.S).     */
/* ------------------------------------------------------------------ */
#if BK7258_BL1_CONSOLE_UART == 0
#  define BOOT_UART_BASE 0x44820000u
#elif BK7258_BL1_CONSOLE_UART == 1
#  define BOOT_UART_BASE 0x45830000u
#elif BK7258_BL1_CONSOLE_UART == 2
#  define BOOT_UART_BASE 0x45840000u
#endif

#if BK7258_BL1_CONSOLE_UART < 3
#  define BOOT_UART_FIFO_ADDR   (BOOT_UART_BASE + 0x1cu)
#  define BOOT_UART_STATUS_ADDR (BOOT_UART_BASE + 0x18u)
#  define BOOT_UART_TX_READY    (1u << 20)
#endif

#ifndef BK7258_BL1_MANIFEST_ENFORCE
#  define BK7258_BL1_MANIFEST_ENFORCE 0u
#endif

#ifndef BK7258_BL1_MANIFEST_RAW_PAGE
#  define BK7258_BL1_MANIFEST_RAW_PAGE 0u
#endif

#ifndef BK7258_BL1_TRUSTENGINE_PROBE
#  define BK7258_BL1_TRUSTENGINE_PROBE 0u
#endif

#ifndef BK7258_BL1_BOOT_CONTROL_STAGING
#  define BK7258_BL1_BOOT_CONTROL_STAGING 0u
#endif

#ifndef BK7258_BL1_USE_BL2
#  define BK7258_BL1_USE_BL2 0u
#endif

#if BK7258_BL1_BOOT_CONTROL_STAGING
#  ifndef BK7258_BL1_BOOT_CONTROL_RAW_OFFSET
#    error "staging boot control requires a raw Flash offset"
#  endif
#  ifndef BK7258_BL1_PRIMARY_MANIFEST_XIP
#    error "staging boot control requires the Primary Manifest XIP address"
#  endif
#  ifndef BK7258_BL1_SECONDARY_MANIFEST_XIP
#    error "staging boot control requires the Secondary Manifest XIP address"
#  endif
#endif

#define REG32(addr)       (*(volatile uint32_t *)(addr))
#if BK7258_BL1_CONSOLE_UART < 3
#  define BOOT_UART_FIFO   REG32(BOOT_UART_FIFO_ADDR)
#  define BOOT_UART_STATUS REG32(BOOT_UART_STATUS_ADDR)
#endif

/* ------------------------------------------------------------------ */
/* FAL partition table (mirrors struct fal_partition from the BK SDK,  */
/* fal_def.h: magic_word/name[24]/flash_name[24]/offset/len/reserved, */
/* 64 bytes per entry). XIP-readable const in .rodata.                 */
/* ------------------------------------------------------------------ */
#define FAL_DEV_NAME_MAX  24
#define FAL_PART_MAGIC    0x45503130u   /* 'E','P','1','0' (fal_partition.c) */

#define FLASH_BASE        BK7258_FLASH_XIP_BASE
#define BL2_RAM_BASE      BK7258_BL2_SRAM_BASE
#define BL2_RAM_END       BK7258_BL2_SRAM_END
#define BL2_COPY_SIZE     BK7258_BL2_COPY_SIZE
#define BL2_VECTOR_COUNT  64u
#define BL2_DATA_RAM_BASE BL2_RAM_BASE
#define BL2_DATA_RAM_END  BL2_RAM_END
#define SCB_ICIALLU       0xe000ef50u

struct fal_partition {
    uint32_t magic_word;
    char     name[FAL_DEV_NAME_MAX];
    char     flash_name[FAL_DEV_NAME_MAX];
    long     offset;        /* logical offset on flash device */
    size_t   len;
    uint32_t reserved;
};

__attribute__((used))
const struct fal_partition fal_partition_table[] = {
    { FAL_PART_MAGIC, "bootloader", "beken_onchip_crc",
      BK7258_ROLE_BOOT_LOGICAL_OFFSET, BK7258_ROLE_BOOT_LOGICAL_SIZE, 0u },
    { FAL_PART_MAGIC, "cp_app",     "beken_onchip_crc",
      BK7258_ROLE_SLOT_A_CP_LOGICAL_OFFSET,
      BK7258_ROLE_SLOT_A_CP_LOGICAL_SIZE, 0u },
    { FAL_PART_MAGIC, "ap_app",     "beken_onchip_crc",
      BK7258_ROLE_SLOT_A_AP_LOGICAL_OFFSET,
      BK7258_ROLE_SLOT_A_AP_LOGICAL_SIZE, 0u },
    { FAL_PART_MAGIC, "bl2",        "beken_onchip_crc",
      BK7258_ROLE_BL2_LOGICAL_OFFSET,
      BK7258_ROLE_BL2_LOGICAL_SIZE, 0u },
};
#define FAL_PART_COUNT  (sizeof(fal_partition_table) / sizeof(fal_partition_table[0]))

/* ------------------------------------------------------------------ */
/* UART output (self-implemented; correct nibble order, no v>>32 UB).  */
/* ------------------------------------------------------------------ */
static void uart_putc(char c)
{
#if BK7258_BL1_CONSOLE_UART >= 3
    (void)c;
#else
    /*
     * Poll bit20 (TX-FIFO-not-full). The poll is bounded: if the bit polarity
     * is ever inverted on silicon, we degrade gracefully to the same
     * write-through behavior the verified minimal bootloader used, rather
     * than hanging the boot.
     */
    for (int i = 0; i < 100000; i++) {
        if (BOOT_UART_STATUS & BOOT_UART_TX_READY) {
            break;
        }
    }
    BOOT_UART_FIFO = (uint32_t)(uint8_t)c;
#endif
}

static void uart_puts(const char *s)
{
    while (*s) {
        uart_putc(*s++);
    }
}

static void print_hex32(uint32_t v)
{
    static const char hex[] = "0123456789ABCDEF";
    int s;
    /* for(s=28; s>=0; s-=4): avoids the v>>32 undefined behaviour that the
       earlier probe fell into (top nibble got shifted into oblivion). */
    for (s = 28; s >= 0; s -= 4) {
        uart_putc(hex[(v >> s) & 0xFu]);
    }
}

static void log_u32(const char *label, uint32_t value)
{
    uart_puts(label);
    uart_puts("0x");
    print_hex32(value);
    uart_puts("\r\n");
}

#if BK7258_BL1_USE_BL2
static int boot_bl2_policy_store(
    const struct bk7258_bl2_boot_policy_s *policy)
{
    volatile struct bk7258_bl2_boot_policy_s *handoff =
        (volatile struct bk7258_bl2_boot_policy_s *)(uintptr_t)
        BK7258_BL2_BOOT_POLICY_ADDRESS;

    if (policy == (const struct bk7258_bl2_boot_policy_s *)0 ||
        policy->magic != BK7258_BL2_BOOT_POLICY_MAGIC ||
        policy->version != BK7258_BL2_BOOT_POLICY_VERSION ||
        policy->preferred_slot > BK7258_BL2_BOOT_POLICY_SLOT_SECONDARY ||
        (policy->fallback_slot != BK7258_BL2_BOOT_POLICY_SLOT_NONE &&
         (policy->fallback_slot > BK7258_BL2_BOOT_POLICY_SLOT_SECONDARY ||
          policy->fallback_slot == policy->preferred_slot)) ||
        policy->source != BK7258_BL2_BOOT_POLICY_SOURCE_FIXED ||
        policy->check != bk7258_bl2_boot_policy_check(policy))
      {
        return -1;
      }

    /* Publish magic last so a reset cannot expose a partially written policy
     * as valid to BL2. */
    handoff->magic = 0;
    __asm volatile ("dsb sy" ::: "memory");
    handoff->version = policy->version;
    handoff->preferred_slot = policy->preferred_slot;
    handoff->fallback_slot = policy->fallback_slot;
    handoff->source = policy->source;
    handoff->state = policy->state;
    handoff->generation_low = policy->generation_low;
    handoff->generation_high = policy->generation_high;
    handoff->check = policy->check;
    __asm volatile ("dsb sy" ::: "memory");
    handoff->magic = policy->magic;
    __asm volatile ("dsb sy" ::: "memory");
    return 0;
}
#endif

