Embracecactus/contest2026_135_yongwangzhiqian/board/bk7258/bootloader/boot_main.c
/* Read-only TrustEngine/Dubhe observation for the reversible bring-up path.
 * These addresses are from the v3.1.1.9 BK7258 register headers and have
 * also been read successfully through SWD on the target.  The probe never
 * changes OTP_SET (in particular DIRECT_RD), never reads key material, and
 * is disabled in the normal boot build. */
#if BK7258_BL1_TRUSTENGINE_PROBE
#  define BK7258_DUBHE_BASE              0x4b110000u
#  define BK7258_DUBHE_TOP_STAT          (BK7258_DUBHE_BASE + 0x100u)
#  define BK7258_DUBHE_OTP_MGR           (BK7258_DUBHE_BASE + 0x400u)
#  define BK7258_DUBHE_OTP_SPACE         (BK7258_DUBHE_BASE + 0x1000u)
#  define BK7258_DUBHE_OTP_UPDATE_STAT   (BK7258_DUBHE_OTP_MGR + 0x10u)
#  define BK7258_DUBHE_OTP_LCS           (BK7258_DUBHE_OTP_SPACE + 0x68u)
#  define BK7258_DUBHE_OTP_LOCK          (BK7258_DUBHE_OTP_SPACE + 0x7cu)

static void trustengine_readonly_probe(void)
{
    log_u32("DUBHE VER ", REG32(BK7258_DUBHE_TOP_STAT + 0x00u));
    log_u32("DUBHE CFG1 ", REG32(BK7258_DUBHE_TOP_STAT + 0x04u));
    log_u32("DUBHE CFG2 ", REG32(BK7258_DUBHE_TOP_STAT + 0x08u));
    log_u32("OTP SET ", REG32(BK7258_DUBHE_OTP_MGR));
    log_u32("OTP STAT ", REG32(BK7258_DUBHE_OTP_UPDATE_STAT));
    log_u32("OTP LCS ", REG32(BK7258_DUBHE_OTP_LCS));
    log_u32("OTP LOCK ", REG32(BK7258_DUBHE_OTP_LOCK));
}
#endif

/* ------------------------------------------------------------------ */
/* Partition scan + helpers.                                          */
/* ------------------------------------------------------------------ */
static int name_eq(const char *a, const char *b)
{
    int i;
    for (i = 0; i < FAL_DEV_NAME_MAX; i++) {
        if (a[i] != b[i]) {
            return 0;
        }
        if (a[i] == '\0') {
            return 1;
        }
    }
    return 1;   /* equal across the full FAL_DEV_NAME_MAX width */
}

static const struct fal_partition *fal_find(const char *name)
{
    size_t i;
    for (i = 0; i < FAL_PART_COUNT; i++) {
        if (fal_partition_table[i].magic_word != FAL_PART_MAGIC) {
            continue;
        }
        if (name_eq(fal_partition_table[i].name, name)) {
            return &fal_partition_table[i];
        }
    }
    return (const struct fal_partition *)0;
}

#if !BK7258_BL1_USE_BL2
/* A direct-boot CP image begins with its Cortex-M vector table and carries
 * the board's fixed BK7236 marker at byte offset 0x100.  Keep this validator
 * distinct from validate_bl2(): a normal NuttX image is deliberately not an
 * MCUboot image and must never be sent to the SRAM BL2 parser. */
static int validate_direct_app(uint32_t image, size_t image_size)
{
    volatile const uint32_t *vec = (volatile const uint32_t *)image;
    uint32_t msp = vec[0];
    uint32_t rst = vec[1];

    if (image_size < 0x108u) {
        uart_puts("BAD\r\napp size\r\n");
        return 0;
    }
    if ((msp & 3u) != 0u || msp < 0x28010000u || msp > 0x28050000u) {
        uart_puts("BAD\r\nmsp align/OOR\r\n");
        return 0;
    }
    if ((rst & 1u) == 0u) {
        uart_puts("BAD\r\nreset no-thumb\r\n");
        return 0;
    }
    if ((rst & ~1u) < image || (rst & ~1u) >= image + image_size) {
        uart_puts("BAD\r\nreset OOR\r\n");
        return 0;
    }
    if (vec[0x100u / sizeof(uint32_t)] != 0x32374b42u) {
        uart_puts("BAD\r\nmagic0\r\n");
        return 0;
    }
    if (vec[0x104u / sizeof(uint32_t)] != 0x00003633u) {
        uart_puts("BAD\r\nmagic1\r\n");
        return 0;
    }

    return 1;
}
#endif

/* ------------------------------------------------------------------ */
/* BL2 header validation (ported from bk7236_min_bl.S to C).          */
/* ------------------------------------------------------------------ */
#if BK7258_BL1_USE_BL2
static int validate_bl2(uint32_t image)
{
    volatile uint32_t *vec   = (volatile uint32_t *)image;
    volatile uint32_t *magic = (volatile uint32_t *)(image + 0x100u);
    uint32_t msp  = vec[0];
    uint32_t rst  = vec[1];
    size_t index;

    /* The current standalone MCUboot BL2 keeps its text, data and reset stack
     * inside the contracted 128 KiB execution window. */
    /* The vector-table MSP is required to be word aligned.  Eight-byte stack
     * alignment is an exception-entry policy (CCR.STKALIGN), not a valid
     * reason to reject an otherwise bootable BL2 image. */
    if ((msp & 3u) != 0u ||
        msp < BL2_DATA_RAM_BASE || msp > BL2_DATA_RAM_END) {
        uart_puts("BAD\r\nmsp align/OOR\r\n");
        return 0;
    }
    /* Reset_Handler must have the Thumb bit set. */
    if ((rst & 1u) == 0u) {
        uart_puts("BAD\r\nreset no-thumb\r\n");
        return 0;
    }
    if ((rst & ~1u) < BL2_RAM_BASE || (rst & ~1u) >= BL2_RAM_END) {
        uart_puts("BAD\r\nbl2 reset OOR\r\n");
        return 0;
    }

    /* BL2 is copied as a complete Cortex-M vector table.  Checking every
     * entry prevents a damaged handler word from redirecting execution to
     * XIP, erased Flash, or an unrelated SRAM window after the handoff. */
    for (index = 2; index < BL2_VECTOR_COUNT; index++) {
        uint32_t handler = vec[index];

        if ((handler & 1u) == 0u ||
            (handler & ~1u) < BL2_RAM_BASE ||
            (handler & ~1u) >= BL2_RAM_END) {
            uart_puts("BAD\r\nbl2 vector OOR\r\n");
            return 0;
        }
    }

    /* app magic @ app_vec + 0x100 == "BK7236\0\0"
       bytes  42 4B 37 32 -> word 0x32374B42
              33 36 00 00 -> word 0x00003633 */
    /* BL2 is an MCUboot ELF, not a BK7236 application image: offset 0x100
     * is executable code.  BL2 authenticates the selected application. */
    (void)magic;
    return 1;
}

/* The Beken flash controller exposes CRC-decoded executable partitions as a
 * continuous XIP byte stream.  BL1 therefore copies logical bytes, never the
 * raw 34/32 flash packets.  The requested copy length must not exceed the
 * valid logical payload encoded in the BL2 partition. */

static int load_bl2_to_ram(uint32_t source, size_t size)
{
    volatile const uint32_t *from = (volatile const uint32_t *)source;
    volatile uint32_t *to = (volatile uint32_t *)BL2_RAM_BASE;
    struct bk7258_bl1_vector_s authorized;
    struct bk7258_bl1_vector_s loaded;
    const struct bk7258_bl1_handoff_window_s window =
      {
        BL2_DATA_RAM_BASE, BL2_DATA_RAM_END,
        BL2_RAM_BASE, BL2_RAM_END
      };
    size_t index;

