Embracecactus/contest2026_135_yongwangzhiqian/board/bk7258/bootloader/boot_main.c
    if (size != BL2_COPY_SIZE || (size & 3u) != 0u) {
        uart_puts("BAD\r\nbl2 size\r\n");
        return 0;
    }

    authorized.msp = from[0];
    authorized.reset = from[1];
    for (index = 0; index < size / sizeof(uint32_t); index++) {
        to[index] = from[index];
    }

    __asm volatile ("dsb sy" ::: "memory");
    REG32(SCB_ICIALLU) = 0;
    __asm volatile ("dsb sy; isb sy" ::: "memory");

    loaded.msp = to[0];
    loaded.reset = to[1];
    if (!bk7258_bl1_handoff_vector_valid(&authorized, &loaded, &window)) {
        uart_puts("BAD\r\nbl2 copy vector\r\n");
        return 0;
    }

    return validate_bl2(BL2_RAM_BASE);
}
#endif

/* ------------------------------------------------------------------ */
/* C entry called from start.S. Returns app logical vector address.   */
/* ------------------------------------------------------------------ */
__attribute__((used))
uint32_t c_main(void)
{
    const struct fal_partition *app;
#if BK7258_BL1_USE_BL2
    struct bk7258_bl2_boot_policy_s bl2_policy;
#endif
    uint32_t app_vec = 0;
#if BK7258_BL1_USE_BL2
#if !BK7258_BL1_MANIFEST_RAW_PAGE
    uint32_t manifest_xip;
#endif
#endif
    int cold_ok = 0;
#if BK7258_BL1_USE_BL2
#if BK7258_BL1_MANIFEST_ENFORCE
    int manifest_status;
#if BK7258_BL1_MANIFEST_RAW_PAGE
    uint8_t manifest_record[BK7258_BL1_MANIFEST_SIZE];
#endif
#endif
    int pair_ok = 0;
    int attempt;
    int slot;
    uint8_t slot_order[2];
#if BK7258_BL1_BOOT_CONTROL_STAGING
    uint8_t boot_control_record[BK7258_BL1_BOOT_FLAG_RECORD_SIZE];
    const struct bk7258_bl1_boot_flag_layout_s boot_control_layout =
      {
        BK7258_BL1_PRIMARY_MANIFEST_XIP,
        BK7258_BL1_SECONDARY_MANIFEST_XIP
      };
    enum bk7258_bl1_boot_flag_status_e boot_flag_status;
#endif
#endif
    int retry;

    uart_puts("u_bootloader enter\r\n");

    /* --- WDT (product-grade): arm both APB + AON watchdogs (~8 s timeout).
     * Mirrors vendor bootloader sub_2000FE4: SYS_CTRL config + key unlock.
     * If boot_clock_cold_init or app validation hangs, WDT resets the chip.
     */

    boot_wdt_init();
    boot_wdt_feed();

    /* --- Cold-start DPLL enable + SPI recalibration.
     * On cold reset the BootROM leaves EN_DPLL=0; boot_clock_cold_init()
     * mirrors the Armino SDK sys_hal_early_init analog-register sequence.
     * If any analog-SPI write times out (ANA_SPI_TIMEOUT), the function
     * returns early and the app sees DPLL off.
     *
     * Retry up to 3 times: SPI timeouts can be transient (power-on noise).
     * Worst-case time: ~100 ms per attempt × 3 = 300 ms << 8 s WDT.
     */

    for (retry = 0; retry < 3; retry++) {
        boot_wdt_feed();
        boot_clock_cold_init();

        /* Check DPLL enable (ANA_REG5 bit5).  If set, cold-init succeeded. */
        if (REG32(0x44010114u) & (1u << 5)) {
            cold_ok = 1;
            break;
        }

        uart_puts("BClk RETRY\r\n");
    }

    boot_wdt_feed();

    if (!cold_ok) {
        /* All retries exhausted: DPLL not enabled.  Do NOT jump to app
         * (app would see BootROM default state, DPLL off, DVFS would try
         * to switch to cksel=2 with DPLL off — undefined behavior).
         * Use the recovered official short watchdog-reset failure path. */
        uart_puts("BClk RETRY FAIL\r\n");
        boot_wdt_fail_reset();
    }

#if BK7258_BL1_TRUSTENGINE_PROBE
    trustengine_readonly_probe();
#endif

#if !BK7258_BL1_USE_BL2
    /* Normal profiles package a raw NuttX vector image at CP slot A.  BL1
     * validates that image in place and returns its logical vector address
     * to the final assembly handoff/optional SWD hold in start.S. */
    boot_wdt_feed();
    app = fal_find("cp_app");
    if (app == (const struct fal_partition *)0) {
        uart_puts("BAD\r\nno cp_app part\r\n");
        boot_wdt_fail_reset();
    }
    if ((uint32_t)app->offset != BK7258_ROLE_SLOT_A_CP_LOGICAL_OFFSET ||
        app->len != BK7258_ROLE_SLOT_A_CP_LOGICAL_SIZE) {
        uart_puts("BAD\r\ncp_app layout\r\n");
        boot_wdt_fail_reset();
    }

    app_vec = FLASH_BASE + (uint32_t)app->offset;
    if (app_vec != BK7258_ROLE_SLOT_A_CP_XIP_START ||
        !validate_direct_app(app_vec, app->len)) {
        boot_wdt_fail_reset();
    }

    boot_wdt_feed();
    __asm volatile ("cpsid i" ::: "memory");
    log_u32("jump to:", app_vec);
    uart_puts("JMP\r\n");
    return app_vec;
#else

    bl2_policy.magic = BK7258_BL2_BOOT_POLICY_MAGIC;
    bl2_policy.version = BK7258_BL2_BOOT_POLICY_VERSION;
    bl2_policy.preferred_slot = BK7258_BL2_BOOT_POLICY_SLOT_PRIMARY;
    bl2_policy.fallback_slot = BK7258_BL2_BOOT_POLICY_SLOT_SECONDARY;
    bl2_policy.source = BK7258_BL2_BOOT_POLICY_SOURCE_FIXED;
    bl2_policy.state = 0u;
    bl2_policy.generation_low = 0u;
    bl2_policy.generation_high = 0u;
    bl2_policy.check = bk7258_bl2_boot_policy_check(&bl2_policy);
    uart_puts("B1FIX\r\n");
    uart_puts("B1POLA\r\n");

    /* --- FAL partition parse -> find the dedicated NuttX MCUboot BL2.
     * BL1 must never enter CP slot A directly once BL2 owns A/B selection.
     */

    boot_wdt_feed();
    app = fal_find("bl2");
    if (app == (const struct fal_partition *)0) {
        uart_puts("BAD\r\nno bl2 part\r\n");
        boot_wdt_fail_reset();
    }
    if ((uint32_t)app->offset != BK7258_ROLE_BL2_LOGICAL_OFFSET ||
        app->len < BL2_COPY_SIZE) {
        uart_puts("BAD\r\nbl2 layout\r\n");
        boot_wdt_fail_reset();
    }
    /* The first-stage code remains in XIP.  The CSV-owned primary BL2 keeps
     * its historical address.  A second, equally sized logical slot follows
     * it in the pre-LittleFS gap.  Each candidate has its own board-owned
     * Manifest record in the boot tail; a failed primary never reaches the
     * MCUboot handoff and is followed by a deterministic secondary attempt. */
    /* The active recoverable layout has no BL1 boot_flag provider, so its
     * default remains Primary -> Secondary.  The opt-in staging build reads
     * the second page of the documented 12 KiB control area through the raw
     * Flash path.  It never writes that page. */
#if BK7258_BL1_BOOT_CONTROL_STAGING
    if (bk7258_bl1_flash_read(BK7258_BL1_BOOT_CONTROL_RAW_OFFSET,
                              boot_control_record,
                              sizeof(boot_control_record)) == 0)
      {
        boot_flag_status = bk7258_bl1_boot_flag_slot_order(
          boot_control_record, sizeof(boot_control_record),
          &boot_control_layout, slot_order);
      }
    else
      {
        boot_flag_status = bk7258_bl1_boot_flag_slot_order(
          (const uint8_t *)0, 0u,
          (const struct bk7258_bl1_boot_flag_layout_s *)0, slot_order);
      }
    uart_puts(boot_flag_status == BK7258_BL1_BOOT_FLAG_VALID_SECONDARY ?
              "B1FLAGB\r\n" :
              boot_flag_status == BK7258_BL1_BOOT_FLAG_VALID_PRIMARY ?
              "B1FLAGA\r\n" : "B1FLAGDEFAULT\r\n");
#else
    (void)bk7258_bl1_boot_flag_slot_order((const uint8_t *)0, 0u,
      (const struct bk7258_bl1_boot_flag_layout_s *)0, slot_order);
#endif
    for (attempt = 0; attempt < 2; attempt++) {
        slot = slot_order[attempt];
        app_vec = slot == 0 ? FLASH_BASE + (uint32_t)app->offset :
                              BK7258_BL2_SECONDARY_XIP;
#if !BK7258_BL1_MANIFEST_RAW_PAGE
        manifest_xip = slot == 0 ? BK7258_BL1_MANIFEST_PRIMARY_XIP_ADDRESS :
                                   BK7258_BL1_MANIFEST_SECONDARY_XIP_ADDRESS;
#endif
#if !BK7258_BL1_MANIFEST_ENFORCE
#if !BK7258_BL1_MANIFEST_RAW_PAGE
        (void)manifest_xip;
#endif
#endif
        uart_puts(slot == 0 ? "B1PRIMARY\r\n" : "B1SECONDARY\r\n");
        log_u32("partition bl2 @ ", app_vec);

#if BK7258_BL1_MANIFEST_ENFORCE
        /* Board-owned authorization only: it binds this exact BL2 before
         * BL1 copies it into SRAM.  It is not an assertion about Beken's
         * unpublished BootROM Manifest ABI.  A software P-256 verification
         * has no opportunity to service either watchdog while it is inside
         * the arithmetic backend, so give it the extended BL2 window. */
        boot_wdt_feed_period(BL2_WDT_PERIOD);
#if BK7258_BL1_MANIFEST_RAW_PAGE
        /* The candidate page lives in the CSV data partitions, not in the
         * CRC-decoded executable XIP tail.  Read only the first 256 bytes;
         * the candidate verifier checks that the remainder of this 4 KiB
         * record container is erased. */
        uart_puts("B1PAGE\r\n");
        manifest_status = bk7258_bl1_flash_read(
            slot == 0 ? BK7258_ROLE_BL1_PRIMARY_MANIFEST_OFFSET :
                        BK7258_ROLE_BL1_SECONDARY_MANIFEST_OFFSET,
            manifest_record, sizeof(manifest_record));
        if (manifest_status == 0)
          {
            manifest_status = bk7258_beken_manifest_verify_buffer(
                manifest_record, app_vec, BL2_COPY_SIZE, BL2_RAM_BASE);
          }
        else
          {
            manifest_status = -5;
          }
#else
        manifest_status = bk7258_bl1_manifest_verify_at(
            manifest_xip, app_vec, BL2_COPY_SIZE, BL2_RAM_BASE);
#endif
        boot_wdt_feed();
        if (manifest_status < 0) {
            log_u32("bl1 manifest rc ", (uint32_t)(-manifest_status));
            uart_puts(slot == 0 ? "B1PRIMARY BAD\r\n" :
                                  "B1SECONDARY BAD\r\n");
            continue;
        }
#endif

        if (!validate_bl2(app_vec) ||
            !load_bl2_to_ram(app_vec, BL2_COPY_SIZE)) {
            uart_puts(slot == 0 ? "B1PRIMARY VECTOR BAD\r\n" :
                                  "B1SECONDARY VECTOR BAD\r\n");
            continue;
        }

        pair_ok = 1;
        break;
    }

    if (!pair_ok) {
        uart_puts("BAD\r\nno bl2 candidate\r\n");
        boot_wdt_fail_reset();
    }

    if (boot_bl2_policy_store(&bl2_policy) < 0) {
        uart_puts("BAD\r\nbl2 policy handoff\r\n");
        boot_wdt_fail_reset();
    }

    /* --- Feed WDT one last time before jumping to app.
     * The app's DVFS bring-up runs quickly (< 1 ms), but if it ever hangs
     * before the NuttX scheduler takes over WDT management, the hardware
     * WDT still fires. */

    boot_wdt_feed();
    __asm volatile ("cpsid i" ::: "memory");
    log_u32("bl2 ram @ ", BL2_RAM_BASE);
    uart_puts("BL2RAM\r\n");
    return BL2_RAM_BASE;
#endif
}
